In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('n_age.csv')
df

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [3]:
df.shape

(9, 4)

In [4]:
rows,columns=df.shape

In [5]:
rows

9

In [6]:
columns

4

In [7]:
df.head()

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m

In [8]:
df.head(3)

   name  age       dob gender
0  Rita   23  20-02-97      f
1  Arun   29  01-07-91      m
2  Sita   14  07-07-06      f

In [9]:
df.tail()

    name  age       dob gender
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [10]:
df.tail(2)

    name  age       dob gender
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [11]:
df[5:8]

    name  age       dob gender
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m
7   Devi   20  05-01-00      f

In [12]:
df[:7]

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m

In [14]:
df[:-3]

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f

In [15]:
df[:3]

   name  age       dob gender
0  Rita   23  20-02-97      f
1  Arun   29  01-07-91      m
2  Sita   14  07-07-06      f

In [16]:
df[3:]

    name  age       dob gender
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [17]:
df.columns

Index(['name', 'age', 'dob', 'gender'], dtype='object')

In [18]:
df.name

0     Rita
1     Arun
2     Sita
3    Varun
4      Ram
5    Radha
6    Mohan
7     Devi
8    Nidhi
Name: name, dtype: object

In [19]:
df['name']

0     Rita
1     Arun
2     Sita
3    Varun
4      Ram
5    Radha
6    Mohan
7     Devi
8    Nidhi
Name: name, dtype: object

In [20]:
df[['name','dob']].head()

    name       dob
0   Rita  20-02-97
1   Arun  01-07-91
2   Sita  07-07-06
3  Varun  01-05-99
4    Ram  07-11-88

In [22]:
type(df)

pandas.core.frame.DataFrame

In [18]:
type(df['name'])

pandas.core.series.Series

In [23]:
df.age.max()

51

In [24]:
df['age'].max()

51

In [25]:
df.age.min()

14

In [22]:
df.age.mean()

26.88888888888889

In [26]:
df.age.std()

10.576441325470071

In [24]:
df.describe()

             age
count   9.000000
mean   26.888889
std    10.576441
min    14.000000
25%    21.000000
50%    23.000000
75%    29.000000
max    51.000000

In [25]:
df[df['age']<30]

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
5  Radha   23  06-09-97      f
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [27]:
df[df['age']>30]

    name  age       dob gender
4    Ram   32  07-11-88      m
6  Mohan   51  03-03-69      m

In [28]:
df[df['age']<30]

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
5  Radha   23  06-09-97      f
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [29]:
df[df['age']==df.age.min()]    #df[df['age']==df['age'].min()]

   name  age       dob gender
2  Sita   14  07-07-06      f

In [30]:
df[df['age']==df.age.max()]

    name  age       dob gender
6  Mohan   51  03-03-69      m

In [31]:
df['name'][df['age']<30]

0     Rita
1     Arun
2     Sita
3    Varun
5    Radha
7     Devi
8    Nidhi
Name: name, dtype: object

In [36]:
df['name'][df['age']>30]

4      Ram
6    Mohan
Name: name, dtype: object

In [37]:
df['name'][df['age']<30]

0     Rita
1     Arun
2     Sita
3    Varun
5    Radha
7     Devi
8    Nidhi
Name: name, dtype: object

In [39]:
df[['name','dob','gender']][df['age']<30]

    name       dob gender
0   Rita  20-02-97      f
1   Arun  01-07-91      m
2   Sita  07-07-06      f
3  Varun  01-05-99      m
5  Radha  06-09-97      f
7   Devi  05-01-00      f
8  Nidhi  10-01-91      f

In [40]:
df[['name','dob','gender']][df['age']>30]

    name       dob gender
4    Ram  07-11-88      m
6  Mohan  03-03-69      m

In [42]:
df[['name','dob','gender']][df['age']<30]

    name       dob gender
0   Rita  20-02-97      f
1   Arun  01-07-91      m
2   Sita  07-07-06      f
3  Varun  01-05-99      m
5  Radha  06-09-97      f
7   Devi  05-01-00      f
8  Nidhi  10-01-91      f

In [43]:
  df

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [44]:
df.loc[0]

name          Rita
age             23
dob       20-02-97
gender           f
Name: 0, dtype: object

In [45]:
df.iloc[8]

name         Nidhi
age             29
dob       10-01-91
gender           f
Name: 8, dtype: object

In [46]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [47]:
df.set_index('name')

       age       dob gender
name
Rita    23  20-02-97      f
Arun    29  01-07-91      m
Sita    14  07-07-06      f
Varun   21  01-05-99      m
Ram     32  07-11-88      m
Radha   23  06-09-97      f
Mohan   51  03-03-69      m
Devi    20  05-01-00      f
Nidhi   29  10-01-91      f

In [48]:
df

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m
5  Radha   23  06-09-97      f
6  Mohan   51  03-03-69      m
7   Devi   20  05-01-00      f
8  Nidhi   29  10-01-91      f

In [49]:
df.head()

    name  age       dob gender
0   Rita   23  20-02-97      f
1   Arun   29  01-07-91      m
2   Sita   14  07-07-06      f
3  Varun   21  01-05-99      m
4    Ram   32  07-11-88      m

In [50]:
df1=df.set_index('name')

In [51]:
df1

       age       dob gender
name
Rita    23  20-02-97      f
Arun    29  01-07-91      m
Sita    14  07-07-06      f
Varun   21  01-05-99      m
Ram     32  07-11-88      m
Radha   23  06-09-97      f
Mohan   51  03-03-69      m
Devi    20  05-01-00      f
Nidhi   29  10-01-91      f

In [58]:
df1.loc['Rita']

age             23
dob       20-02-97
gender           f
Name: Rita, dtype: object

In [59]:
df1.iloc[0]

age             23
dob       20-02-97
gender           f
Name: Rita, dtype: object

In [60]:
df1.loc['Ram']

age             32
dob       07-11-88
gender           m
Name: Ram, dtype: object

In [61]:
df

       age       dob gender
name
Rita    23  20-02-97      f
Arun    29  01-07-91      m
Sita    14  07-07-06      f
Varun   21  01-05-99      m
Ram     32  07-11-88      m
Radha   23  06-09-97      f
Mohan   51  03-03-69      m
Devi    20  05-01-00      f
Nidhi   29  10-01-91      f